use book_manage_sys;

insert into books values
(1, '三国演义', 83.00, '罗贯中', '2019-6-1', 1, 1),
(2, '上下五千年', 115.00, '赵文博', '2016-4-30', 2, 2),
(3, '天龙八部', 124.20, '金庸', '2020-5-1', 5, 1),
(4, '数据结构c语言版', 30.60, '严蔚敏', '2018-6-1', 3, 6),
(5, '世界观', 78.20, '理查德·德威特', '2020-8-1', 6, 3),
(6, '一千零一夜', 26.00, '阿拉伯民间故事', '2018-5-1', 1, 4),
(7, 'Python学习手册', 160.60, '马克·卢茨', '2018-11-1', 6, 6),
(8, '线性代数', 19.80, '同济大学数学系', '2014-6-1', 4, 5),
(9, '小王子', 26.10, '圣埃克苏佩里', '2015-11-1', 7, 4),
(10, '时间简史', 12.00, '霍金', '2015-11-1', 7, 3),
(11, '物理学史', 69.10, '郭奕玲', '2005-8-1', 3, 5),
(12, '史记', 198.00, '司马迁', '2016-8-1', 8, 2),
(13, '围城', 24.20, '钱钟书', '1991-2-1', 1, 1);

insert into publishers values
(1, '人民文学出版社', '北京市'),
(2, '辽海出版社', '沈阳市'),
(3, '清华大学出版社', '北京市'),
(4, '高等教育出版社', '北京市'),
(5, '广州出版社', '广州市'),
(6, '机械工业出版社', '北京市'),
(7, '中国华侨出版社', '北京市'),
(8, '北京联合出版社', '北京市');

insert into sort values
(1, '小说'),
(2, '文史'),
(3, '社会科学'),
(4, '少儿'),
(5, '教材'),
(6, '计算机');